After adding ignore to all

```
lifecycle {
  ignore_changes = all
}
```
the diff is shown as below:
```
  ~ resource "cloudflare_zero_trust_access_application" "test" {
      ~ aud                          = "dc7b25bfc7d0aa7dbc06406a910a3dc3b17b270025a66d9fa37c9115d9c040af" -> (known after apply)
      ~ created_at                   = "2025-06-02T12:43:46Z" -> (known after apply)
        id                           = "355886c2-d2bf-4514-93b6-5748227d3111"
      + landing_page_design          = (known after apply)
        name                         = "test"
      + path_cookie_attribute        = false
      + saas_app                     = (known after apply)
      + skip_app_launcher_login_page = false
        tags                         = []
      ~ updated_at                   = "2025-06-02T13:37:18Z" -> (known after apply)
        # (13 unchanged attributes hidden)
    }
```

It seems like the issue is that the provider doesn't see the current state for some of the fields above, values from the state file. 

```
"aud": "dc7b25bfc7d0aa7dbc06406a910a3dc3b17b270025a66d9fa37c9115d9c040af", (matches)
"created_at": "0001-01-01T00:00:00Z",
"landing_page_design": null,
"path_cookie_attribute": false,
"saas_app": null,
"skip_app_launcher_login_page": false,
```
I'd bet that issue is with bugged `created_at` or one of the attributes that already match value but still show as diff `path_cookie_attribute` or `skip_app_launcher_login_page`